icardea-interop-fmwork/xds/views/phccis_pnr.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soapenv:Header>
		<wsa:To>{{xds_endpoint}}</wsa:To>
		<wsa:MessageID>{{message_uuid}}</wsa:MessageID>
		<wsa:Action>urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<xdsb:ProvideAndRegisterDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007">
			<lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
				<rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
					<rim:ExtrinsicObject id="Document01" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
						<rim:Slot name="creationTime">
							<rim:ValueList>
								<rim:Value>{{doc_creation_time}}</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="languageCode">
							<rim:ValueList>
								<rim:Value>el</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="serviceStartTime">
							<rim:ValueList>
								<rim:Value>{{visit_start}}</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="serviceStopTime">
							<rim:ValueList>
								<rim:Value>{{visit_end}}</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Slot name="sourcePatientId">
							<rim:ValueList>
								<rim:Value>{{patient_id}}</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<!--
				<rim:Slot name="sourcePatientInfo">
					<rim:ValueList>
						<rim:Value>PID-3|pid1^^^123.ISO</rim:Value>
						<rim:Value>PID-5|Doe^John^^^</rim:Value>
						<rim:Value>PID-7|19560527</rim:Value>
						<rim:Value>PID-8|M</rim:Value>
						<rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
					</rim:ValueList>
				</rim:Slot>
-->
						<rim:Name/>
						<rim:Description/>
						<rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="Document01" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_1">
							<rim:Slot name="authorPerson">
								<rim:ValueList>
									<!--							<rim:Value>^Dopplemeyer^Sherry^^^</rim:Value> -->
									<rim:Value>{{author}}</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorInstitution">
								<rim:ValueList>
									<rim:Value>PHCCIS GP System</rim:Value>
								</rim:ValueList>
							</rim:Slot>
						</rim:Classification>
						<rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="Document01" nodeRepresentation="History and Physical" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_4">
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon classCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="History and Physical"/>
							</rim:Name>
						</rim:Classification>
						<rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="Document01" nodeRepresentation="CDAR2/IHE 1.0" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_5">
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon formatCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="CDAR2/IHE 1.0"/>
							</rim:Name>
						</rim:Classification>
						<!--<rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="Document01" nodeRepresentation="Outpatient" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_6">
					<rim:Slot name="codingScheme">
						<rim:ValueList>
							<rim:Value>healthCareFacilityTypeCode 	</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					<rim:Name>
						<rim:LocalizedString value="Outpatient"/>
					</rim:Name>
				</rim:Classification>-->
				<rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="Document01" nodeRepresentation="General Medicine" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_7">
					<rim:Slot name="codingScheme">
						<rim:ValueList>
							<rim:Value>Connect-a-thon practiceSettingCodes</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					<rim:Name>
						<rim:LocalizedString value="General Medicine"/>
					</rim:Name>
				</rim:Classification>
						<rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="Document01" nodeRepresentation="11492-6" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_8">
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<!-- LOINC -->
									<rim:Value>2.16.840.1.113883.6.1</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name/>
						</rim:Classification>
						<rim:ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="{{patient_id}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_9" registryObject="Document01">
							<rim:Name>
								<rim:LocalizedString value="XDSDocumentEntry.patientId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<rim:ExternalIdentifier identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="{{doc_uuid}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_10" registryObject="Document01">
							<rim:Name>
								<rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
					</rim:ExtrinsicObject>
					<rim:RegistryPackage id="SubmissionSet01" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
						<rim:Slot name="submissionTime">
							<rim:ValueList>
								<!-- <rim:Value>20041225235050</rim:Value>-->
								<rim:Value>{{submission_time}}</rim:Value>
							</rim:ValueList>
						</rim:Slot>
						<rim:Name/>
						<rim:Description/>
						<!-- Submission Set author -->
						<rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="SubmissionSet01" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_11">
							<rim:Slot name="authorPerson">
								<rim:ValueList>
									<!--							<rim:Value>^Dopplemeyer^Sherry^^^</rim:Value> -->
									<rim:Value>^PHCCCIS icardea Bridge^^^^</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Slot name="authorInstitution">
								<rim:ValueList>
									<rim:Value>FORTH</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<!-- 
					<rim:Slot name="authorRole">
						<rim:ValueList>
							<rim:Value>SUBMISSION_SET_AUTHOR_ROLE</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					<rim:Slot name="authorSpecialty">
						<rim:ValueList>
							<rim:Value>SUBMISSION_SET_AUTHOR_SPECIALTY</rim:Value>
						</rim:ValueList>
					</rim:Slot>
					-->
						</rim:Classification>
						<!-- Submission Set Content Type Code-->
						<rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="SubmissionSet01" nodeRepresentation="History and Physical" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_12">
							<rim:Slot name="codingScheme">
								<rim:ValueList>
									<rim:Value>Connect-a-thon contentTypeCodes</rim:Value>
								</rim:ValueList>
							</rim:Slot>
							<rim:Name>
								<rim:LocalizedString value="History and Physical"/>
							</rim:Name>
						</rim:Classification>
						<rim:ExternalIdentifier identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="{{sset_uuid}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_13" registryObject="SubmissionSet01">
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<rim:ExternalIdentifier identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="PHCCIS" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_14" registryObject="SubmissionSet01">
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
						<rim:ExternalIdentifier identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="{{patient_id}}" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_15" registryObject="SubmissionSet01">
							<rim:Name>
								<rim:LocalizedString value="XDSSubmissionSet.patientId"/>
							</rim:Name>
						</rim:ExternalIdentifier>
					</rim:RegistryPackage>
					<rim:Classification classifiedObject="SubmissionSet01" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" id="ID_1216346_1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
					<rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="SubmissionSet01" targetObject="Document01" id="ID_1216346_2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
						<rim:Slot name="SubmissionSetStatus">
							<rim:ValueList>
								<rim:Value>Original</rim:Value>
							</rim:ValueList>
						</rim:Slot>
					</rim:Association>
				</rim:RegistryObjectList>
			</lcm:SubmitObjectsRequest>
			<xdsb:Document id="Document01">{{base64_document}}</xdsb:Document>
		</xdsb:ProvideAndRegisterDocumentSetRequest>
	</soapenv:Body>
</soapenv:Envelope>